Revit 2024 API
Opening.SketchId Property
 Returns id of the Sketch or invalidElementId if element deon't own the Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public ElementId SketchId { get; }
Visual Basic
Public ReadOnly Property SketchId As ElementId
	Get
Visual C++
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
See Also
Opening Class
Autodesk.Revit.DB Namespace